astrobin_apps_payments/tests/data/ultimate_yearly_first_order/invoice.updated.json

{
  "id": "evt_1NBuLFC0tT6bv7HdrFr9rNfN",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685083296,
  "data": {
    "object": {
      "id": "in_1NBuLCC0tT6bv7Hd2Hnagnce",
      "object": "invoice",
      "account_country": "CH",
      "account_name": "AstroBin",
      "account_tax_ids": null,
      "amount_due": 2250,
      "amount_paid": 2250,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "subscription_create",
      "charge": "ch_3NBuLDC0tT6bv7Hd0ZK2Vg6M",
      "collection_method": "charge_automatically",
      "created": 1685083294,
      "currency": "usd",
      "custom_fields": null,
      "customer": "STRIPE_CUSTOMER_ID",
      "customer_address": {
        "city": null,
        "country": "US",
        "line1": null,
        "line2": null,
        "postal_code": "12345",
        "state": null
      },
      "customer_email": "astrobin@astrobin.com",
      "customer_name": "Test User",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "discounts": [
      ],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1BW8j3C0tT6bv7Hd/test_YWNjdF8xQlc4ajNDMHRUNmJ2N0hkLF9OeHExU2tZdE5VYktsSGtzMGFjWUlkQkg2U01rZUlnLDc1NjI0MDk30200619hSjJK?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1BW8j3C0tT6bv7Hd/test_YWNjdF8xQlc4ajNDMHRUNmJ2N0hkLF9OeHExU2tZdE5VYktsSGtzMGFjWUlkQkg2U01rZUlnLDc1NjI0MDk30200619hSjJK/pdf?s=ap",
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1NBuLCC0tT6bv7Hda9lVJIWF",
            "object": "line_item",
            "amount": 2250,
            "amount_excluding_tax": 2250,
            "currency": "usd",
            "description": "1 × AstroBin Ultimate (at $67.00 / year)",
            "discount_amounts": [
            ],
            "discountable": true,
            "discounts": [
            ],
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": 1716705694,
              "start": 1685083294
            },
            "plan": {
              "id": "STRIPE_PRICE_ULTIMATE_YEARLY_TIER_1_TEST",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1684945592,
              "currency": "chf",
              "interval": "year",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "AstroBin Ultimate 1 year recurring (tier 1)",
              "product": "STRIPE_PRODUCT_ULTIMATE_TEST",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "STRIPE_PRICE_ULTIMATE_YEARLY_TIER_1_TEST",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1684945592,
              "currency": "chf",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": "AstroBin Ultimate 1 year recurring (tier 1)",
              "product": "STRIPE_PRODUCT_ULTIMATE_TEST",
              "recurring": {
                "aggregate_usage": null,
                "interval": "year",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "exclusive",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1NBuLCC0tT6bv7HdsEJE5BMx",
            "subscription_item": "si_Nxq1aYTvbM19If",
            "tax_amounts": [
            ],
            "tax_rates": [
            ],
            "type": "subscription",
            "unit_amount_excluding_tax": "2250"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1NBuLCC0tT6bv7Hd2Hnagnce/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "3EEC5948-0001",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3NBuLDC0tT6bv7Hd0N3Dosyv",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1685083294,
      "period_start": 1685083294,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering_options": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1685083294,
        "marked_uncollectible_at": null,
        "paid_at": 1685083296,
        "voided_at": null
      },
      "subscription": "sub_1NBuLCC0tT6bv7HdsEJE5BMx",
      "subtotal": 2250,
      "subtotal_excluding_tax": 2250,
      "tax": null,
      "test_clock": null,
      "total": 2250,
      "total_discount_amounts": [
      ],
      "total_excluding_tax": 2250,
      "total_tax_amounts": [
      ],
      "transfer_data": null,
      "webhooks_delivered_at": null
    },
    "previous_attributes": {
      "amount_paid": 0,
      "amount_remaining": 2250,
      "attempt_count": 0,
      "attempted": false,
      "charge": null,
      "paid": false,
      "status": "open",
      "status_transitions": {
        "paid_at": null
      }
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_ZpcYMVo3n1NdDl",
    "idempotency_key": "23060f11-1a46-4544-aa39-09982ea04d8b"
  },
  "type": "invoice.updated"
}
